/* --COPYRIGHT--
 *
 * --/COPYRIGHT--*/
//*****************************************************************************
//
// console.h - заголовочный файл для console.c.
//
//*****************************************************************************
#ifndef CONSOLE_H
#define CONSOLE_H

#ifdef __cplusplus
extern "C"
{
#endif
/*********************************************************************
 * INCLUDES
 */
#include "uart.h"

/*********************************************************************
 * MACROS
 */

/*********************************************************************
 * CONSTANTS
 */

/*********************************************************************
 * TYPEDEFS
 */

/*********************************************************************
 * GLOBAL VARIABLES
 */

/*********************************************************************
 * CLASSES
 */

/**
Класс, обеспечивающий вывод на последовательный порт диагностических сообщение, а также прием команд управления.

\author von Boduen.
*/
class Console
{
public:
  /**
  Конструктор "по умолчанию".
  */
  Console();

  /**
  Настраивает модуль eUSCI для работы в качестве UART консоли.
  */
  void begin(uint32_t bitrate);

  /**
  Метод, который должен регулярно вызываться в главном цикле программы.
  Опрашивает последовательный порт и возвращает код поступившей из консоли команды.
  */
  uint8_t run();

  /**
  Метод, который выводит на последовательный порт содержание пакета с данными о состоянии линий ввода/вывода (пакет 0x83).
  */
  void printIoSamplePacket(RxIoSampleResponse& ioSample);

  void print(char const  *buffer_p);
  void println(char const *buffer_p);
  void print(uint32_t parameter, uint8_t radix);
  void println(uint32_t parameter, uint8_t radix);


protected:

private:
  uint8_t* ultoa(uint32_t num, uint8_t *buf, uint8_t radix);
 };

/*********************************************************************
*********************************************************************/

#ifdef __cplusplus
}
#endif
#endif //CONSOLE_H
